oscar_odin/fixtures/oscar_odin/test_discount/order.json

[
{
    "model": "order.paymenteventquantity",
    "pk": 73,
    "fields": {
        "event": 41,
        "line": 37,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 74,
    "fields": {
        "event": 41,
        "line": 38,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 75,
    "fields": {
        "event": 41,
        "line": 39,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 76,
    "fields": {
        "event": 41,
        "line": 40,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 77,
    "fields": {
        "event": 41,
        "line": 41,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 78,
    "fields": {
        "event": 42,
        "line": 37,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 79,
    "fields": {
        "event": 42,
        "line": 38,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 80,
    "fields": {
        "event": 42,
        "line": 39,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 81,
    "fields": {
        "event": 42,
        "line": 40,
        "quantity": 1
    }
},
{
    "model": "order.paymenteventquantity",
    "pk": 82,
    "fields": {
        "event": 42,
        "line": 41,
        "quantity": 1
    }
},
{
    "model": "order.order",
    "pk": 21,
    "fields": {
        "number": "100022",
        "site": 1,
        "basket": null,
        "user": 4,
        "billing_address": null,
        "currency": "EUR",
        "total_incl_tax": "552.92",
        "total_excl_tax": "461.73",
        "shipping_incl_tax": "49.95",
        "shipping_excl_tax": "41.28",
        "shipping_tax_code": "high",
        "shipping_address": 21,
        "shipping_method": "Standaard verzending",
        "shipping_code": "standaard-verzending",
        "status": "paid",
        "date_placed": "2024-03-07T11:07:19.159Z"
    }
},
{
    "model": "order.order",
    "pk": 22,
    "fields": {
        "number": "100023",
        "site": 1,
        "basket": null,
        "user": 4,
        "billing_address": null,
        "currency": "EUR",
        "total_incl_tax": "349.99",
        "total_excl_tax": "289.25",
        "shipping_incl_tax": "349.99",
        "shipping_excl_tax": "289.25",
        "shipping_tax_code": "high",
        "shipping_address": 21,
        "shipping_method": "Standaard verzending",
        "shipping_code": "standaard-verzending",
        "status": "paid",
        "date_placed": "2024-03-07T11:07:19.159Z"
    }
},
{
    "model": "order.line",
    "pk": 37,
    "fields": {
        "order": 21,
        "partner": 2,
        "partner_name": "Clothing partner",
        "partner_sku": "horloge",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 225,
        "product": 237,
        "title": "Horloge",
        "upc": "horloge",
        "quantity": 1,
        "line_price_incl_tax": "349.99",
        "line_price_excl_tax": "289.25",
        "line_price_before_discounts_incl_tax": "349.99",
        "line_price_before_discounts_excl_tax": "289.25",
        "unit_price_incl_tax": "349.99",
        "unit_price_excl_tax": "289.25",
        "tax_code": "high",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.line",
    "pk": 38,
    "fields": {
        "order": 21,
        "partner": 2,
        "partner_name": "Clothing partner",
        "partner_sku": "normale-schoen",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 226,
        "product": 240,
        "title": "Normale Schoen",
        "upc": "normale-schoen",
        "quantity": 1,
        "line_price_incl_tax": "68.99",
        "line_price_excl_tax": "57.01",
        "line_price_before_discounts_incl_tax": "69.99",
        "line_price_before_discounts_excl_tax": "57.84",
        "unit_price_incl_tax": "69.99",
        "unit_price_excl_tax": "57.84",
        "tax_code": "high",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.line",
    "pk": 39,
    "fields": {
        "order": 21,
        "partner": 2,
        "partner_name": "Clothing partner",
        "partner_sku": "kleine-tas",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 227,
        "product": 241,
        "title": "Kleine Tas",
        "upc": "kleine-tas",
        "quantity": 1,
        "line_price_incl_tax": "38.99",
        "line_price_excl_tax": "35.77",
        "line_price_before_discounts_incl_tax": "39.99",
        "line_price_before_discounts_excl_tax": "36.69",
        "unit_price_incl_tax": "39.99",
        "unit_price_excl_tax": "36.69",
        "tax_code": "low",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.line",
    "pk": 40,
    "fields": {
        "order": 21,
        "partner": 3,
        "partner_name": "Book partner",
        "partner_sku": "duur-boek",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 223,
        "product": 239,
        "title": "Duur boek",
        "upc": "duur-boek",
        "quantity": 1,
        "line_price_incl_tax": "31.50",
        "line_price_excl_tax": "26.04",
        "line_price_before_discounts_incl_tax": "34.99",
        "line_price_before_discounts_excl_tax": "28.92",
        "unit_price_incl_tax": "34.99",
        "unit_price_excl_tax": "28.92",
        "tax_code": "high",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.line",
    "pk": 41,
    "fields": {
        "order": 21,
        "partner": 3,
        "partner_name": "Book partner",
        "partner_sku": "goedkoop-boek",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 224,
        "product": 238,
        "title": "Goedkoop boek",
        "upc": "goedkoop-boek",
        "quantity": 1,
        "line_price_incl_tax": "13.50",
        "line_price_excl_tax": "12.38",
        "line_price_before_discounts_incl_tax": "14.99",
        "line_price_before_discounts_excl_tax": "13.75",
        "unit_price_incl_tax": "14.99",
        "unit_price_excl_tax": "13.75",
        "tax_code": "low",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.line",
    "pk": 37,
    "fields": {
        "order": 22,
        "partner": 2,
        "partner_name": "Clothing partner",
        "partner_sku": "horloge",
        "partner_line_reference": "",
        "partner_line_notes": "",
        "stockrecord": 225,
        "product": 237,
        "title": "Horloge",
        "upc": "horloge",
        "quantity": 1,
        "line_price_incl_tax": "349.99",
        "line_price_excl_tax": "289.25",
        "line_price_before_discounts_incl_tax": "349.99",
        "line_price_before_discounts_excl_tax": "289.25",
        "unit_price_incl_tax": "349.99",
        "unit_price_excl_tax": "289.25",
        "tax_code": "high",
        "status": "paid",
        "num_allocated": 0
    }
},
{
    "model": "order.shippingaddress",
    "pk": 21,
    "fields": {
        "title": "Mr",
        "first_name": "Gijs",
        "last_name": "klaas",
        "line1": "lochemseweg",
        "line2": "",
        "line3": "",
        "line4": "Harfesn",
        "state": "",
        "postcode": "1234AB",
        "country": "NL",
        "search_text": "Gijs klaas lochemseweg Harfesn 1234AB Netherlands",
        "phone_number": "",
        "notes": ""
    }
},
{
    "model": "order.ordernote",
    "pk": 37,
    "fields": {
        "order": 21,
        "user": null,
        "note_type": "System",
        "message": "Pending payment from dummy payment",
        "date_created": "2024-03-07T11:07:19.237Z",
        "date_updated": "2024-03-07T11:07:19.237Z"
    }
},
{
    "model": "order.ordernote",
    "pk": 38,
    "fields": {
        "order": 21,
        "user": null,
        "note_type": "System",
        "message": "Paid with dummy payment",
        "date_created": "2024-03-07T11:07:20.895Z",
        "date_updated": "2024-03-07T11:07:20.895Z"
    }
},
{
    "model": "order.orderstatuschange",
    "pk": 37,
    "fields": {
        "order": 21,
        "old_status": "new",
        "new_status": "pending-payment",
        "date_created": "2024-03-07T11:07:19.237Z"
    }
},
{
    "model": "order.orderstatuschange",
    "pk": 38,
    "fields": {
        "order": 21,
        "old_status": "pending-payment",
        "new_status": "paid",
        "date_created": "2024-03-07T11:07:20.894Z"
    }
},

{
    "model": "order.lineprice",
    "pk": 37,
    "fields": {
        "order": 21,
        "line": 37,
        "quantity": 1,
        "price_incl_tax": "349.99",
        "price_excl_tax": "289.25",
        "shipping_incl_tax": "0.00",
        "shipping_excl_tax": "0.00",
        "tax_code": "high"
    }
},
{
    "model": "order.lineprice",
    "pk": 38,
    "fields": {
        "order": 21,
        "line": 38,
        "quantity": 1,
        "price_incl_tax": "68.99",
        "price_excl_tax": "57.01",
        "shipping_incl_tax": "0.00",
        "shipping_excl_tax": "0.00",
        "tax_code": "high"
    }
},
{
    "model": "order.lineprice",
    "pk": 39,
    "fields": {
        "order": 21,
        "line": 39,
        "quantity": 1,
        "price_incl_tax": "38.99",
        "price_excl_tax": "35.77",
        "shipping_incl_tax": "0.00",
        "shipping_excl_tax": "0.00",
        "tax_code": "low"
    }
},
{
    "model": "order.lineprice",
    "pk": 40,
    "fields": {
        "order": 21,
        "line": 40,
        "quantity": 1,
        "price_incl_tax": "31.50",
        "price_excl_tax": "26.04",
        "shipping_incl_tax": "0.00",
        "shipping_excl_tax": "0.00",
        "tax_code": "high"
    }
},
{
    "model": "order.lineprice",
    "pk": 41,
    "fields": {
        "order": 21,
        "line": 41,
        "quantity": 1,
        "price_incl_tax": "13.50",
        "price_excl_tax": "12.38",
        "shipping_incl_tax": "0.00",
        "shipping_excl_tax": "0.00",
        "tax_code": "low"
    }
},
{
    "model": "order.shippingeventtype",
    "pk": 1,
    "fields": {
        "name": "Verzonden",
        "code": "shipped"
    }
},
{
    "model": "order.paymentevent",
    "pk": 41,
    "fields": {
        "order": 21,
        "amount": "552.92",
        "reference": "100022",
        "event_type": 1,
        "shipping_event": null,
        "date_created": "2024-03-07T11:07:19.239Z"
    }
},
{
    "model": "order.paymentevent",
    "pk": 42,
    "fields": {
        "order": 21,
        "amount": "552.92",
        "reference": "100022",
        "event_type": 2,
        "shipping_event": null,
        "date_created": "2024-03-07T11:08:01.517Z"
    }
},
{
    "model": "order.paymenteventtype",
    "pk": 1,
    "fields": {
        "name": "pending-payment",
        "code": "pending-payment"
    }
},
{
    "model": "order.paymenteventtype",
    "pk": 2,
    "fields": {
        "name": "paid",
        "code": "paid"
    }
},
{
    "model": "order.paymenteventtype",
    "pk": 3,
    "fields": {
        "name": "cancelled",
        "code": "cancelled"
    }
},
{
    "model": "order.orderdiscount",
    "pk": 6,
    "fields": {
        "order": 21,
        "category": "Basket",
        "offer_id": 1,
        "offer_name": "10 procent korting op boeke",
        "voucher_id": null,
        "voucher_code": "",
        "frequency": 1,
        "amount": "4.98",
        "message": ""
    }
},
{
    "model": "order.orderdiscount",
    "pk": 7,
    "fields": {
        "order": 21,
        "category": "Basket",
        "offer_id": 2,
        "offer_name": "1 euro korting per product",
        "voucher_id": null,
        "voucher_code": "",
        "frequency": 1,
        "amount": "2.00",
        "message": ""
    }
},
{
    "model": "order.orderlinediscount",
    "pk": 18,
    "fields": {
        "line": 38,
        "order_discount": 7,
        "is_incl_tax": true,
        "amount": "1.00"
    }
},
{
    "model": "order.orderlinediscount",
    "pk": 19,
    "fields": {
        "line": 39,
        "order_discount": 7,
        "is_incl_tax": true,
        "amount": "1.00"
    }
},
{
    "model": "order.orderlinediscount",
    "pk": 20,
    "fields": {
        "line": 40,
        "order_discount": 6,
        "is_incl_tax": true,
        "amount": "3.49"
    }
},
{
    "model": "order.orderlinediscount",
    "pk": 21,
    "fields": {
        "line": 41,
        "order_discount": 6,
        "is_incl_tax": true,
        "amount": "1.49"
    }
}
]
